# -*- coding: utf-8 -*-
import os, re

fin = "d:\\xhome\\data\\upload\\神雕侠侣.txt"
#fin = "d:\\xhome\\data\\upload\\射雕英雄传.txt"
#fin = "d:\\xhome\\data\\upload\\天龙八部.txt"
#fout = "d:\\xhome\\data\\outfile\\天龙八部_人物_degrees.csv"
#fout = "d:\\xhome\\data\\outfile\\天龙八部_降龙十八掌_degrees.csv"
#fout = "d:\\xhome\\data\\outfile\\射雕英雄传_降龙十八掌_degrees.csv"
fout = "d:\\xhome\\data\\outfile\\神雕侠侣_降龙十八掌_degrees.csv"

book=os.path.split(fin)[1].split('.')[0]   #书名

#repl = '段誉|段正明|段正淳|段延庆|皇妃|刀白凤|秦红棉|甘宝宝|阮星竹|王夫人|阿萝|王语嫣|木婉清|钟灵|高升泰|巴天石|华赫艮|范骅|褚万里|古笃诚|傅思归|朱丹臣|南海鳄神|云中鹤|钟万仇|崔百泉|过彦之|枯荣大师|本因|本观|本相|本参|黄眉大师|破疑|破嗔|鸠摩智|乔峰|萧峰|萧远山|阿朱|阿紫|游坦之|马夫人|徐长老|白世镜|项长老|陈长老|吴长老|宋长老|奚长老|全冠清|张全祥|李春来|刘竹庄|易大彪|完颜阿骨打|耶律洪基|耶律重元|耶律涅鲁古|和哩布|耶律莫哥|室里|颇拉苏|游骥|游驹|赵钱孙|单正|单伯山|单仲山|单叔山|单季山|单小山|智光大师|朴者|向望海|祁六|鲍千灵|许卓诚|谭公|谭婆|谭青|虚竹|玄慈|叶二娘|无涯子|天山童姥|李秋水|梦姑|苏星河|丁春秋|康广陵|范百龄|苟读|吴领军|薛慕华|冯阿三|石清露|李傀儡|摘星子|天狼子|出尘子|乌老大|桑土公|玄黄子|章达夫|瑞木元|黎夫人|安岛主|区岛主|哈大霸|余婆|石嫂|符敏仪|程青霜|梅剑|兰剑|竹剑|菊剑|左子穆|辛双清|司空玄|不平道长|芙蓉仙子崔绿华|剑神卓不凡|珠崖双怪|钦岛主|霍洞主|司马岛主|于洞主|云岛主|龚光杰|容子矩|干光豪|葛光佩|郁光标|钱光胜|唐光雄|扫地僧|玄渡|玄难|玄痛|玄苦|玄寂|玄惭|玄愧|玄念|玄净|玄垢|玄鸣|玄石|玄灭|玄生|慧真|慧观|慧净|慧方|慧轮|止清|止湛|止渊|缘根|青松|慕容博|慕容复|阿碧|邓百川|公冶乾|包不同|风波恶|神山上人|观心大师|道清大师|觉贤大师|融智大师|神音和尚|哲罗星|波罗星|姚伯当|司马林|诸保昆|诸葛中|马五德|赫连铁树|努儿海|宗赞王子|赵煦|范祖禹|苏辙|范纯仁|瑞婆婆|平婆婆|严妈妈|幽草|小翠|小茶|小茗|诸师弟|姜师叔|孟师叔|阿洪|阿胜|老顾|老汪|小毕|老贾|金二|玄悲|五叶大师|玄澄|灵门禅师|元元大师|七指头陀|汪剑通|柯百岁|孙三霸|九翼道人|秦伯起|章虚道长|都灵道长|司马卫|秦公望|海风子|王维义|鹤云道长|方大雄|乔三槐夫妇|骆氏三雄|包不靓|神仙姊姊'
repl = '亢龙有悔|飞龙在天|见龙在田|鸿渐于陆|潜龙勿用|利涉大川|突如其来|震惊百里|或跃在渊|双龙取水|鱼跃于渊|时乘六龙|密云不雨|损则有孚|龙战于野|履霜冰至|羝羊触藩|神龙摆尾'

d = {}

try:
	with open(fin, 'r', encoding='utf-8') as in_file:
		for f in in_file:
			l=re.findall(repl,f)
			for k in l:
				if k in d:
					d[k] += 1
				else:
					d.update({k:1})
except IOError:
	print('File error..')

d=sorted(d.items(),key=lambda a:a[1],reverse=True)

id = 1
try:
	with open(fout, 'w', encoding='utf-8') as out_file:
		#print('《天龙八部》人物出现频次排名(Top40)\n序号,名字,频度')
		#print('《射雕英雄传》降龙十八掌出招频度\n序号,招式,频度')
		print('《神雕侠侣》降龙十八掌出招频度\n序号,招式,频度')
		print('id,name,degrees', file=out_file)
		for l in d:
			print(str(id)+','+l[0]+','+str(l[1]))
			print(str(id)+','+l[0]+','+str(l[1]), file=out_file)
			id += 1
except IOError:
	print('File error..')
